Repository: developsessions/b-r-udp-broadcast
Catalog: Automation Studio/as/system/A0453/Texts/EventLog_AR.tmx
Source language: en
Languages: de

source: Requested additional parameters are not available
de: Ein benötigter zusätzlicher Parametersatz ist nicht vorhanden

source: Parameter checksums are not available
de: Parameter Prüfsummen sind nicht verfügbar

source: Parameter checksum sizes do not match
de: Größe der Parameterprüfsummen stimmt nicht überein

source: Random number is too high
de: Zufallszahl ist zu hoch

source: Object 0x1200, 0x01 (SDN) was accessed with attribute . This attribute is illegal object SDN.
de: Auf das Objekt 0x1200, 0x01 (SDN) wurde mit dem Attribute zugegriffen. Dieses Attribute ist für das Objekt SDN nicht erlaubt.

source: NC object not found ('bus_typ','modul_adr','object_typ','channel')
de: NC-Objekt nicht gefunden ('bus_typ','modul_adr','object_typ','channel')

source: ncalloc: Task class code invalid
de: ncalloc: Taskklassen-Kennung ungültig

source: ncalloc: System Manager module not found
de: ncalloc: System-Manager-Modul nicht gefunden

source: ncalloc: INSTALL error for NC task for TC start (enough TC stack ?)
de: ncalloc: INSTALL-Fehler für NC-Task für TK-Anfang (genug TK-Stack ?)

source: ncalloc: INSTALL error for NC task for TC end (enough TC stack ?)
de: ncalloc: INSTALL-Fehler für NC-Task für TK-Ende (genug TK-Stack ?)

source: ncalloc: Invalid flag combination
de: ncalloc: Unzulässige Flag-Kombination

source: ncalloc: Invalid data length
de: ncalloc: Ungültige Datenlänge

source: Invalid NC function pointer
de: Ungültiger NC-Funktionspointer

source: 'nc_object' is not a valid NC object
de: 'nc_object' ist kein gültiges NC-Objekt

source: 'subject' is not defined or not allowed for this 'nc_object'
de: 'subject' ist nicht definiert oder für dieses 'nc_object' nicht erlaubt

source: 'action' is not defined or not allowed for this 'subject'
de: 'action' ist nicht definiert oder für dieses 'subject' nicht erlaubt

source: TType of 'nc_object' is invalid
de: Typ von 'nc_object' ist ungültig

source: Type of data object is invalid
de: Ungültiger Typ bei Datenobjektoperation angegeben

source: This NC action is blocked because the initialization of the corresponding NC object is not yet completed or was aborted due to an error.
de: Diese NC-Aktion ist gesperrt, weil die Initialisierung des entsprechenden NC-Objekts noch nicht abgeschlossen ist oder wegen eines Fehlers abgebrochen wurde.

source: Inconsistence between data length (00 bytes) and frame length (00 bytes), if the frame uses CRC8.
de: Widerspruch bei der Datenlänge (00 Bytes) und der Framelänge (00 Bytes), falls der Frame CRC8 benützt

source: Inconsistence between data length (00 bytes) and frame length (00 bytes), if the frame uses CRC16.
de: Widerspruch bei der Datenlänge (00 Bytes) und der Framelänge (00 Bytes), falls der Frame CRC16 benützt

source: The value in the LE field (00)of the received frame exceed valid range.
de: Der Wert in dem LE Feld (00) des empfangen Frame überschritt den Gültigkeitsbereich

source: The received EPLS frame contains different frame Id's in sub frame ONE (0) and in sub frame TWO (0).
de: Der empfangene EPLS Frame enthält unterschiedliche Frame IDs im Subframe eins (0) und im Subframe zwei (0)

source: The value in the LE field (00) of the received frame exceeds valid range (<= k_MAX_DATA_LEN).
de: Der Wert im LE Feld (00) des empfangen Frames überschritt den Gültigkeitsbereich (<= k_MAX_DATA_LEN)

source: The payload data of sub frame one and two is not equal.
de: Die Nutzdaten des Subframe eins und zwei sind nicht gleich

source: The checksum (CRC8) of sub frame one (00) is NOT correct.
de: Die Prüfsumme (CRC8) des Subframes eins (00) ist nicht korrekt

source: The checksum (CRC16) of sub frame one (0000) is NOT correct.
de: Die Prüfsumme (CRC16) des Subframes eins (0000) ist nicht korrekt

source: The checksum (CRC8) of sub frame two (00) is NOT correct.
de: Die Prüfsumme (CRC8) des Subframes zwei (00) ist nicht korrekt

source: The checksum (CRC16) of sub frame two (0000) is NOT correct.
de: Die Prüfsumme (CRC16) des Subframes zwei (0000) ist nicht korrekt

source: The type of data (00) to be copied is NOT defined.
de: Der Typ (00) der zu kopierenden Daten ist nicht definiert

source: The received frame length (0000) is NOT correct.
de: Die Empfangene Framelänge (0000) ist nicht korrekt

source: The received address (00) in the ADR field of EPLS sub frame one is invalid.
de: Die empfangene Adresse (00) im ADR Feld des EPLS Subframes eins ist ungültig

source: The received domain number (0000) in the ADR field of EPLS sub frame two is invalid.
de: Die Empfangene Domainnummer (0000) in dem ADR Feld des EPLS Subframes zwei ist ungültig

source: The value in the ADR field (0000) of the frame to be transmitted is NOT correct.
de: Der Wert im ADR Feld (0000) des zu übertragenden Frames ist nicht korrekt

source: The frame ID (0000) of the frame to be transmitted is NOT correct.
de: Die Frame ID (0000) des zu übertragenden Frames ist nicht korrekt

source: The domain number (0000) of the frame to be transmitted is NOT correct.
de: Die Domainnummer (0000) des zu übertragenden Frames ist nicht korrekt

source: The payload data length (0000) of the frame to be transmitted is NOT correct.
de: Die Nutzdatenlänge (0000) des zu übertragenden Frames ist nicht korrekt

source: The time request address (0000) of the frame to be transmitted is NOT correct.
de: Die Time-Request Adresse (0000) des zu übertragenden Frames ist nicht korrekt

source: The time request distinctive number (00) of the frame to be transmitted is NOT correct.
de: Die Time-Request Erkennungsnummer (00) des zu übertragenden Frames ist nicht korrekt

source: The frame length (0000) provided by the application is an even number, which is NOT possible.
de: Die von der Applikation unterstützte Frame Länge (0000) ist eine gerade Zahl, was nicht möglich ist

source: No memory block for frame transmission available from unit SHNF.
de: Es ist kein Speicherblock für eine Frame Übertragung von der SHNF Einheit vorhanden

source: Memory block for frame transmission cannot be passed to unit SHNF.
de: Speicherblock für die Frameübertragung konnte nicht an die SHNF Einheit übergeben werden

source: The received address (00) in the TADR field of EPLS sub frame one is invalid.
de: Die Empfangene Adresse (00) im TADR Feld des EPLS Subframes eins ist ungültig

source: Before read callback is registered for the UDID of the SCM SOD object with index 0x1200 and sub-index 0x04
de: Bevor der Lesecallback für die UDID des SCM SOD Objekts mit dem Index 0x1200 und Subindex 0x04 registriert ist

source: 'nc_object' is not an NC object with type 'ncCNCSYS'
de: 'nc_object' ist kein NC-Objekt mit Typ 'ncCNCSYS'

source: CNC -> PLC: M function not within the defined range
de: CNC -> SPS: MoS-Funktion nicht im definierten Bereich

source: CNC -> PLC: M_S function not within the defined range
de: CNC -> SPS: MmS-Funktion nicht im definierten Bereich

source: 'rec_index' invalid (<0 or too large)
de: 'rec_index' ungültig (<0 oder zu groß)

source: 'nc_obj_ax1' is not a valid NC object
de: 'nc_obj_ax1' ist kein gültiges NC-Objekt

source: 'nc_obj_ax2' is not a valid NC object
de: 'nc_obj_ax2' ist kein gültiges NC-Objekt

source: 'nc_obj_ax1' is not an NC object with type 'ncAXIS' or 'ncV_AXIS'
de: 'nc_obj_ax1' ist kein NC-Objekt mit Typ ncACHSE oder ncV_ACHSE

source: 'nc_obj_ax2' is not an NC object with type 'ncAXIS' or 'ncV_AXIS'
de: 'nc_obj_ax2' ist kein NC-Objekt mit Typ ncACHSE oder ncV_ACHSE

source: 'nc_obj_ax1' and 'nc_obj_ax2' have different HW types
de: 'nc_obj_ax1' und 'nc_obj_ax2' haben unterschiedliche HW-Typen

source: Unexpected FSM event (00) occurred.
de: Unerwartetes FSM Event (00) aufgetreten

source: An Invalid transition into SN state 00 is requested.
de: Ein ungültiger Wechsel in den SN Status 00 wurde angefragt

source: NULL pointer passed instead of reference to .
de: Null Pointer durchgereicht, anstatt einer Referenz zur UDID

source: Function call with invalid additional SADR (0000).
de: Funktion mit ungültiger zusätzlicher SADR (0000) aufgerufen

source: Function call with invalid SPDO number (0000).
de: Funktion mit ungültiger SPDO Nummer (0000) aufgerufen

source: No FSM available to process the SNMT Request, actually.
de: Zur Zeit ist kein FSM für die Abarbeitung der SNMT Anfrage verfügbar

source: Maximum number of SNMT Service Request repetitions of service (00) reached.
de: Maximale Anzahl der SNMT Service Anfragen (00) Wiederholungen wurde erreicht

source: The received SNMT Service Response with ID 00 could NOT be assigned.
de: Die Empfangene SNMT Service Antwort, mit der ID 00, konnte nicht zugewiesen werden

source: The received SNMT Service Response contains an invalid frame ID (00).
de: Die Empfangene SNMT Service Antwort enthält eine ungültige Frame ID (00)

source: The received SNMT Service Response was rejected by SNMTM filter - target address: 0000.
de: Die empfangene SNMT Service Antwort wurde vom SNMTM Filter abgelehnt - Zieladresse: 0000

source: The value in TR field (00) of the received frame is NOT zero.
de: Der Wert im TR Feld (00) des empfangenen Frames ist null

source: The value in CT field (0000) of the received frame is NOT zero.
de: Der Wert im CT Feld (0000) des empfangenen Frames ist nicht null

source: FSM was called with invalid event in state .
de: FSM wurde mit einem ungültigen Event im Status aufgerufen

source: The reference to the number of free frames is invalid
de: Die Referenz auf die gültigen Übertragungspuffer ist invalid

source: No SNMT Master finite state machine is available to process a service request
de: Es ist kein SNMT Master verfügbar um die Service Anfrage zu beantworten

source: The provided instance number (00) is bigger than the maximum value.
de: Die bereitgestellte Instanznummer (00) ist größer als der maximale Wert

source: NO management frames available to build and transmit.
de: Es sind keine Management-Frames zum Erstellen und Übertragen verfügbar

source: Error group 4 was passed by the application.(Reserved for EPLS Stack internal errors).
de: Fehlergruppe 4 wurde von der Applikation bearbeitet (reserviert für die EPLS Stack Internen Fehler)

source: The value in LE field (00) of the received Service is NOT valid.
de: Der Wert im LE Feld (00) des empfangenen Service ist ungültig

source: Payload length of the extended SNMT service request is 0.
de: Nutzdatenlänge des erweiterten SNMT Service-Requests ist 0.

source: The frame ID (00) of the received SNMT Service is NOT defined.
de: Die Frame ID (00) des empfangenen SNMT Service ist nicht definiert

source: It is only one transmit SPDO configurable. Assignment of the additional SADR can not be accomplished
de: Es ist nur ein übertragungs SPDO konfigurierbar. Die zusätzliche SADR konnte nicht zugewiesen werden

source: The extended service type (00) of the received SNMT Service is NOT defined.
de: Der Erweiterte Service Typ (00) des empfangenen SNMT Service ist ungültig

source: The received SNMT Service was rejected by SNMTS filter - target address: 0 safety domain number: 0
de: Der empfangene SNMT Service wurde vom SNMTS Filter zurückgewiesen - Ziel Adresse: 0, SDN: 0

source: Received UDID is NOT equal to the UDID of this SN.
de: Empfangene UDID ist nicht gleich der UDID des SNs

source: The provided state pointer is NULL.
de: Der Unterstützte Status Pointer ist null

source: Undefined FSM state (00) occurred.
de: Undefinierter FSM Status (00) aufgetreten

source: k_EVT_RX_SET_TO_OP event is unexpected.
de: Unerwartetes Event: k_EVT_RX_SET_TO_OP

source: k_EVT_RX_UDID_SCM event is unexpected.
de: Unerwartetes Event: k_EVT_RX_UDID_SCM

source: k_EVT_RX_SADR_ADD event is unexpected.
de: Unerwartetes Event: k_EVT_RX_SADR_ADD

source: k_EVT_SN_ACK event is unexpected.
de: Unerwartetes Event: k_EVT_SN_ACK

source: k_EVT_RX_SET_TO_PREOP event is unexpected.
de: Unerwartetes Event: k_EVT_RX_SET_TO_PREOP

source: The rx and the tx buffer pointer must not be NULL with the (00) calling event.
de: Der rx und der tx Puffer-Pointer dürfen nicht null sein mit dem (00) Aufrufereignis

source: The received SPDO number (00) is NOT in valid range.
de: Die Empfangene SPDO Nummer (00) ist nicht im Gültigkeitsbereich

source: No SOD index can be found for the SPDO number (00).
de: Es konnte kein SOD Index für die SPDO Nummer (00) gefunden werden

source: The received checksum (0000) is NOT equal to calculated checksum (0000).
de: Die empfangene Prüfsumme (0000) ist nicht gleich der berechneten Prüfsumme (0000)

source: The received parameter timestamp (00000000) is wrong.
de: Der empfangene Parameter Zeitstempel (00000000) ist falsch

source: The guard timer was not started but checked.
de: Die Guard-Time würde nicht gestartet, aber überprüft

source: The lifetime elapsed.
de: Die Lifetime wurde überschritten

source: The refresh time elapsed.
de: Die Refresh-Time wurde überschritten

source: Unexpected error group and/or error code were received Exp. error group : (00) error code : (00) Rec. error group : (00) error code : (00)
de: Unerwartete Fehlergruppe und/oder Fehlercode empfangen Erwartete Fehlergruppe: (00), Fehlercode: (00) Empfangene Fehlergruppe: (00), Fehlercode: (00)

source: Unexpected SN ack received (no SN FAIL was sent).
de: Unerwartete SN Bestätigung empfangen (es wurde kein SN FAIL gesendet)

source: Unexpected return value for Callback Switch received
de: Unerwarteter Rückgabewert für Statuswechsel erhalten

source: Handshake for extended counter failed
de: Vereinbarung für erweiterten Zähler konnte nicht durchgeführt werden

source: Instance number is invalid. SSDO abort code : 0
de: Instanznummer ist ungültig. SSDO Abbruchcode : 0

source: The object with standard data type (UINT8/16/32, INT8/16/32, REAL32, BOOLEAN), must not be accessed segmented (offset and size must be 0). SSDO abort code : 0
de: Die Objekte mit den Standarddatentypen (UINT8/16/32, INT8/16/32, REAL32, BOOLEAN) dürfen nicht aufgeteilt werden.

source: The byte position is outside of the object data range (offset or/and size are wrong). SSDO abort code : 0
de: Die Byte Position ist außerhalb des Datenbereichs des Objekts (Offset und/oder Größe sind falsch) SSDO Abbruch Code : 0

source: The SAPL_SOD_ReadClbk() application callback function has signaled error SSDO abort code : 0
de: Die Applikations Callback Funktion SAPL_SOD_ReadClbk() hat einen Fehler signalisiert SSDO Abbruch Code : 0

source: Instance number is invalid SSDO abort code : 0
de: Instanznummer ist ungültig SSDO Abbruchcode: 0

source: invalid data pointer
de: ungültiger Datenpointer

source: The SOD write access is disabled by the application SSDO abort code : 0
de: Der SOD Schreibzugriff wird durch die Applikation verhindert SSDO Abbruchcode: 0

source: The object with standard data type (UINT8/16/32, INT8/16/32, REAL32, BOOLEAN), must not be accessed segmented (offset and size must be 0) SSDO abort code : 0
de: Die Objekte mit den Standarddatentypen (UINT8/16/32, INT8/16/32, REAL32, BOOLEAN) dürfen nicht aufgeteilt werden SSDO Abbruchcode: 0

source: The byte position is outside of the object data range (offset or/and size are wrong) SSDO abort code : 0
de: Die Byte Position ist außerhalb des Objekt Datenbereichs (Offset und/oder Größe sind falsch) SSDO Abbruchcode: 0

source: The SAPL_SOD_WriteClbk() application callback function has signaled error SSDO abort code : 0
de: Die Applikations Callback Funktion SAPL_SOD_WriteClbk() hat einen Fehler signalisiert SSDO Abbruchcode: 0

source: The object is not writeable SSDO abort code : 0
de: Das Objekt ist nicht schreibbar SSDO Abbruchcode: 0

source: Invalid visible string. SSDO abort code : 0
de: Ungültiger VISIBLE STRING

source: The value to be written is too high SSDO abort code : 0
de: Der zu schreibende Wert ist zu hoch SSDO Abbruchcode: 0

source: The value to be written is too low. SSDO abort code : 0
de: Der zu schreibende Wert ist zu niedrig SSDO Abbruchcode: 0

source: The value to be written is not BOOLEAN value (0 or 1) SSDO abort code : 0
de: Der zu schreibende Wert ist kein boolescher Wert (0 oder 1) SSDO Abbruchcode

source: Data type is unknown SSDO abort code : 0
de: Datentyp ist unbekannt SSDO Abbuchcode: 0

source: Before Read SOD Callback was aborted. SSDO abort code : 0
de: Bevor der Read SOD Callback abgebrochen wurde SSDO Abbruchcode: 0

source: Before Write SOD Callback was aborted SSDO abort code : 0
de: Bevor der Write SOD Callback abgebrochen wurde SSDO Abbruchcode: 0

source: After Write SOD Callback was aborted SSDO abort code : 0
de: Nachdem Write SOD Callback abgebrochen wurde SSDO Abbruchcode: 0

source: Actual length of the SOD entry can not be set by the application SSDO abort code : 0
de: Aktuelle Länge des SOD Eintrags konnte nicht durch die Applikation gesetzt werden SSDO Abbruchcode: 0

source: Actual length to be set is larger than the maximum length of the object SSDO abort code : 0
de: Aktuelle zu setzende Länge ist größer als als die maximale Länge des Objekts SSDO Abbruchcode: 0

source: Actual length is tried to set for an object with standard data type. Actual length can be set only for the objects with data type DOMAIN, OCTET STRING or VISIBLE STRING SSDO abort code : 0
de: Es wurde versucht die Aktuelle Länge für ein Objekt mit Standard Datentyp zu setzten. Aktuelle Länge kann nur für Objekte mit den Datentypen DOMAIN, OCTET STRING oder VISIBLE STRING gesetzt werden SSDO Abbruchcode: 0

source: Pointer to the actual length is NULL. SSDO abort code : 0
de: Pointer auf die Aktuelle Länge ist null. SSDO Abbruchcode: 0

source: Actual length of the SOD entry can not be get by the application. SSDO abort code : 0
de: Die Applikation konnte die aktuelle Länge des SOD Eintrags nicht erhalten. SSDO Abbruchcode: 0

source: Reference to the object dictionary is NULL.
de: Die Referenz auf das Objektverzeichnis ist null.

source: Object dictionary is empty at the instance (0).
de: An dieser Instanz (0) ist das Objektverzeichnis leer.

source: Pointer to the object handle is NULL. SSDO abort code : 0
de: Pointer auf das Objekt-handle ist null. SSDO Abbruchcode: 0

source: Pointer to the application object is NULL. SSDO abort code : 0
de: Pointer auf das Applikation-Objekt ist null. SSDO Abbruchcode: 0

source: The SAPL_SOD_AttrGetClbk() application callback function has signaled error. SSDO abort code : 0
de: Die SAPL_SOD_AttrGetClbk() Applikation-Callback-Funktion hat einen Fehler signalisiert. SSDO Abbruchcode: 0

source: The SOD object was not found. SSDO abort code : 0
de: Das SOD Objekt wurde nicht gefunden. SSDO Abbruchcode: 0

source: Object handle address does not point to a SOD object. SSDO abort code : 0
de: Objekt-Handle Adresse zeigt nicht auf ein SOD Objekt. SSDO Abbruchcode: 0

source: Access to the SOD object is locked. SSDO abort code : 0
de: Zugriff auf das SOD Objekt ist gesperrt. SSDO Abbruchcode: 0

source: Application object is not able to be locked. SSDO abort code : 0
de: Applikation Objekt konnte nicht gesperrt werden. SSDO Abbruchcode: 0

source: SOD_Unlock() was called without SOD_Lock(). SSDO abort code : 0
de: SOD_Unlock() wurde ohne SOD_Lock() aufgerufen. SSDO Abbruchcode: 0

source: Application object is not able to be unlocked. SSDO abort code : 0
de: Applikation Objekt konnte nicht freigeschaltet werden. SSDO Abbruchcode: 0

source: SOD_EnableSodWrite() was called without SOD_DisableSodWrite(). SSDO abort code : 0
de: SOD_EnableSodWrite() wurde ohne SOD_DisableSodWrite() aufgerufen. SSDO Abbruchcode: 0

source: SOD write access is already disabled. SSDO abort code : 0
de: SOD schreib Zugriff ist schon ausgeschaltet. SSDO Abbruchcode: 0

source: The SAPL_SOD_DefaultValueSetClbk() application callback function has signaled error.
de: die Applikation Callback Funktion SAPL_SOD_DefaultValueSetClbk() signalisierte einen Fehler.

source: Range checking is not supported for the object with SOD index (0) sub-index (0).
de: Bereichsprüfung wird vom Objekt nicht unterstützt, SOD Index (0), Subindex (0).

source: SOD object: data pointer undefined
de: SOD-Objekt: Datenpointer undefiniert

source: No pointer to pointer to object data has been defined for the object with SOD index (0) sub-index (0).
de: Für das Objekt wurde kein Pointer auf einen Pointer, welcher auf ein Daten Objekt zeigt, definiert, SOD Index (0), Subindex (0).

source: The object with SOD index (0) sub-index (0) is not sorted by SOD index.
de: Das Objekt ist nicht nach dem SOD Index sortiert, SOD Index (0), Subindex (0)

source: The object with SOD index (0) sub-index (0) is not sorted by SOD sub-index.
de: Das Objekt ist nicht nach dem SOD Subindex sortiert, SOD Index (0), Subindex (0)

source: The attribute of the object with SOD index (0) sub-index (0) is invalid.
de: Das Attribute des Objekts ist ungültig, SOD Index (0), Subindex (0)

source: No access flag (RO_CONST,RO,WO) in the attribute of the object with SOD index (0) sub-index (0) is set.
de: Kein Zugriffsflag (RO_CONST, RO, WO) in den Attributen des Objekts, SOD Index (0), Subindex (0)

source: Access flags (RO_CONST,RO,WO) in the attribute of the object with SOD index (0) sub-index (0) is set.
de: Zugriffsflag (RO_CONST, RO, WO) in den Attributen des Objekts gesetzt, SOD Index (0), Subindex (0)

source: No default value has been given for the object with SOD index (0) sub-index (0).
de: Kein default Wert wurde für das Objekt spezifiziert, SOD Index (0), Subindex (0)

source: Flag to call a callback function is set in the attribute of the object with SOD index (0) sub-index (0) but no callback function pointer is given.
de: In den Attributen des Objekts mit dem SOD Index (0) Subindex (0) ist ein Flag für das Aufrufen einer Callback gesetzt, jedoch wurde kein Callback-Funktionspointer übergeben.

source: Callback function pointer is given for the object with SOD index (0) sub-index (0) but no flag to call a callback function is set in the attribute entry.
de: Ein Callback Funktionspointer wurde übergeben, jedoch ist in den Attributen des Objekts mit SOD Index (0) Subindex (0) kein Flag für dessen Aufruf gesetzt

source: The given range for the object with SOD index (0) sub-index (0) is wrong, because the maximum value is smaller the minimum value.
de: Der zugewiesene Bereich für das Objekt mit SOD Index (0) Subindex (0) ist falsch, weil der maximale Wert kleiner dem minimalen Wert ist

source: Data type is (UINT8 or INT8 or BOOLEAN) of the object with SOD index (0) sub-index (0) but the data length is not 1.
de: Datentyp des Objekts mit dem SOD Index (0) Subindex (0) ist (UINT8 oder INT8 oder BOOLEAN) aber die Datenlänge ist nicht 1

source: Data type is (UINT16 or INT16) of the object with SOD index (0) sub-index (0) but the data length is not 2.
de: Datentyp des Objekts mit dem SOD Index (0) Subindex (0) ist (UINT16 oder INT16) aber die Datenlänge ist nicht 2

source: Data type is (UINT32 or INT32 or REAL32) of the object with SOD index (0) sub-index (0) but the data length is not 4.
de: Der Datentyp des Objekts mit dem SOD Index (0) Subindex (0) ist (UINT32 oder INT32 oder REAL32), jedoch ist die Datenlänge nicht 4

source: Data type is (DOMAIN or VISIBLE/OCTET STRING) of the object with SOD index (0) sub-index (0) but the maximum data length is 0.
de: Der Datentyp de Objekts mit dem SOD Index (0) Subindex (0) ist (DOMAIN oder VISIBLE/OCTET STRING), jedoch ist die maximale Datenlänge 0

source: Data type is (UINT64 or INT64 or REAL64) of the object with SOD index (0) sub-index (0) but the data length is not 8.
de: Der Datentyp des Objekts mit dem SOD Index (0) Subindex (0) ist (UINT64 oder INT64 oder REAL64), jedoch ist die Datenlänge nicht 8

source: Data type of the object with SOD index (0) sub-index (0) is not supported .
de: Der Datentyp des Objekts mit dem SOD Index (0) Subindex (0) wird nicht unterstützt
